designingSparks/psoc4_u8g2/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "CyClock_24.h"
#include "CyCLK_48MHz.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MOSI.h"
#include "MOSI_aliases.h"
#include "SPIMaster.h"
#include "SPIMaster_PVT.h"
#include "SCLK.h"
#include "SCLK_aliases.h"
#include "Clock_SPI.h"
#include "SS.h"
#include "SS_aliases.h"
#include "pin_DC.h"
#include "pin_DC_aliases.h"
#include "pin_RES.h"
#include "pin_RES_aliases.h"
#include "pin_CS.h"
#include "pin_CS_aliases.h"
#include "UART_RX_ISR.h"
#include "UART_1.h"
#include "UART_1_SPI_UART.h"
#include "UART_1_PINS.h"
#include "UART_1_SPI_UART_PVT.h"
#include "UART_1_PVT.h"
#include "UART_1_BOOT.h"
#include "v_EEPROM.h"
#include "IDAC_1.h"
#include "IDAC1_OUT.h"
#include "IDAC1_OUT_aliases.h"
#include "SW1.h"
#include "SW1_aliases.h"
#include "Clock_2.h"
#include "PWM_T2.h"
#include "PWM_TON.h"
#include "LPComp_0.h"
#include "CompPos.h"
#include "CompPos_aliases.h"
#include "CompNeg.h"
#include "CompNeg_aliases.h"
#include "debug1.h"
#include "debug1_aliases.h"
#include "COMP_DDFT0_Out.h"
#include "COMP_DDFT0_Out_aliases.h"
#include "startPWM.h"
#include "sw_hi.h"
#include "sw_hi_aliases.h"
#include "debug2.h"
#include "debug2_aliases.h"
#include "debug3.h"
#include "debug3_aliases.h"
#include "Counter.h"
#include "ISR_decayCount.h"
#include "Clock_5.h"
#include "ZCD.h"
#include "ZCD_aliases.h"
#include "ADC_SAR.h"
#include "isr_ADC.h"
#include "Vin_adc.h"
#include "Vin_adc_aliases.h"
#include "PWM_Buzzer.h"
#include "BUZ.h"
#include "BUZ_aliases.h"
#include "SW2.h"
#include "SW2_aliases.h"
#include "SW3.h"
#include "SW3_aliases.h"
#include "UART_1_SCBCLK.h"
#include "UART_1_tx.h"
#include "UART_1_tx_aliases.h"
#include "UART_1_rx.h"
#include "UART_1_rx_aliases.h"
#include "ADC_SAR_IRQ.h"
#include "ADC_SAR_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

